<?php

// একটি ত্রিভুজ, আয়তক্ষেত্র, বর্গক্ষেত্র এবং বৃত্তের ক্ষেত্রফল বের করার জন্য প্রোগ্রাম


//ত্রিভুজের ক্ষেত্রফল
// ত্রিভুজের ক্ষেত্রফলের সূত্র = 1/2 × (ভূমি × উচ্চতা) বর্গ একক / বর্গমিটার

$ভূমি = 70;
$উচ্চতা = 70;
$ত্রিভুজেরক্ষেত্রফল = (1/2)*($ভূমি * $উচ্চতা);

echo "&nbsp&nbsp ত্রিভুজের ভূমি = {$ভূমি},\n ত্রিভুজের উচ্চতা = {$উচ্চতা} <br>"; 
echo "∴ ত্রিভুজের ক্ষেত্রফল = {$ত্রিভুজেরক্ষেত্রফল} বর্গ একক. <br><br>";

// আয়তক্ষেত্রের ক্ষেত্রফল 
// আয়তক্ষেত্রের ক্ষেত্রফলের সূত্র = (দৈর্ঘ্য × প্রস্থ) বর্গ একক / বর্গমিটার

$width = 70;
$height = 70;
$rectangleArea = $width * $height;

echo "&nbsp&nbsp আয়তক্ষেত্রের দৈর্ঘ্য = {$width}, আয়তক্ষেত্রের প্রস্থ = {$height} <br>"; 
echo "∴ আয়তক্ষেত্রের ক্ষেত্রফল = {$rectangleArea} বর্গমিটার. <br><br>";


// বর্গক্ষেত্রের ক্ষেত্রফল 
// বর্গক্ষেত্রের ক্ষেত্রফলের সূত্র = (দৈর্ঘ্য × দৈর্ঘ্য) বর্গএকক / বর্গমিটার

$width = 70;
$height = 70;
$squareArea = $width * $height;

echo "&nbsp&nbsp বর্গক্ষেত্রের দৈর্ঘ্য = {$width}, বর্গক্ষেত্রের প্রস্থ = {$height} <br>"; 
echo "∴ বর্গক্ষেত্রের ক্ষেত্রফল = {$squareArea} বর্গমিটার. <br><br>";



// বৃত্তের ক্ষেত্রফল 
// বৃত্তের ক্ষেত্রফল = π * (r*r)    --> এখানে r হলো বৃত্তের ব্যাসার্ধ। যা বৃত্তের কেন্দ্র থেকে পরিধি পর্যন্ত দূরত্ব।
// π = 3.14159 Or π = 22/7

$radiusOfCircle = 70;
$pai = 3.14159;
$areaOfCircle = $pai * ($radiusOfCircle*$radiusOfCircle);

echo "&nbsp&nbsp বৃত্তের ব্যাসার্ধ = {$radiusOfCircle}, <br>"; 
echo "∴ বৃত্তের ক্ষেত্রফল = {$areaOfCircle} বর্গমিটার. <br><br>";





?>