<?php


//ত্রিভুজের ক্ষেত্রফল
$ভূমি = 73;
$উচ্চতা = 47;
$ত্রিভুজেরক্ষেত্রফল = (1/2)*($ভূমি * $উচ্চতা);

echo "&nbsp&nbsp ত্রিভুজের ভূমি = {$ভূমি},\n ত্রিভুজের উচ্চতা = {$উচ্চতা} <br>"; 
echo "∴ ত্রিভুজের ক্ষেত্রফল = {$ত্রিভুজেরক্ষেত্রফল} বর্গ একক. <br><br>";

//আয়তক্ষেত্রের ক্ষেত্রফল 
$width = 12;
$height = 40;
$rectangleArea = $width * $height;

echo "&nbsp&nbsp আয়তক্ষেত্রের দৈর্ঘ্য = {$width}, আয়তক্ষেত্রের প্রস্থ = {$height} <br>"; 
echo "∴ আয়তক্ষেত্রের ক্ষেত্রফল = {$rectangleArea} বর্গমিটার. <br><br>";


//বর্গক্ষেত্র ক্ষেত্রফল 
$width = 15;
$height = 30;
$squareArea = $width * $height;

echo "&nbsp&nbsp বর্গক্ষেত্রের দৈর্ঘ্য = {$width}, বর্গক্ষেত্রের প্রস্থ = {$height} <br>"; 
echo "∴ বর্গক্ষেত্রের ক্ষেত্রফল = {$squareArea} বর্গমিটার. <br><br>";

//বৃত্তের ক্ষেত্রফল 
$width = 15;
$height = 30;
$squareArea = $width * $height;

echo "&nbsp&nbsp বর্গক্ষেত্রের দৈর্ঘ্য = {$width}, বর্গক্ষেত্রের প্রস্থ = {$height} <br>"; 
echo "∴ বৃত্তের ক্ষেত্রফল = {$squareArea} বর্গমিটার. <br><br>";



// ত্রিভুজ, আয়তক্ষেত্র, বর্গক্ষেত্র এবং বৃত্তের ক্ষেত্রফল এর সূত্র বর্গ একক

// echo "বর্গ একক";  দৈর্ঘ্য  প্রস্থ

?>